#========================================
set_time_format -unit ns \
                -decimal_places 3
#========================================

#========================================
# Input clock 50 MHz
create_clock    [get_ports  {clk}]      \
                -name       {clk}       \
                -period     20.0        \
                -waveform   {0.0 10.0}
#========================================

#========================================
#set_input_delay     -clock {clk}    \
                    1.1 [all_inputs]
#========================================

#========================================
#set_output_delay    -clock {clk}    \
                    0.5 [all_outputs]
#========================================

#========================================
set_false_path      -from   [get_ports {rstn}] \
                    -to     [all_registers]
#========================================

#========================================
derive_pll_clocks
derive_clock_uncertainty
#========================================